### Null values etc

In [1]:
# Important : Whatever concat type you use it just join both DataFrames either on below having separate index or on side-by-side
# depending on axis , but it not actually merge both or any sort of relationship b/w them.

In [2]:
import pandas as pd
import numpy as np

In [4]:
df = pd.read_clipboard()

In [5]:
df

  training  Tools  fee
0       DS    NaN  NaN
1       ML    NaN  NaN
2       DL    2.0  NaN
3       DS    4.0  4.0

In [19]:
s1 = pd.Series(['2','#ali',2000])

In [20]:
pd.to_numeric(s1, errors='ignore')

0       2
1    #ali
2    2000
dtype: object

In [21]:
a = pd.to_numeric(s1, errors='coerce')

In [22]:
a

0       2.0
1       NaN
2    2000.0
dtype: float64

In [25]:
df.drop(columns='Tools',axis=1)

  training  fee
0       DS  NaN
1       ML  NaN
2       DL  NaN
3       DS  4.0

In [28]:
df

  training  Tools  fee
0       DS    NaN  NaN
1       ML    NaN  NaN
2       DL    2.0  NaN
3       DS    4.0  4.0

In [30]:
# Documentation : df.dropna(axis=0, how='any', thresh=None, subset=None, inplace=False)
df.dropna(how='any') # It means if any row have null values then drop it.

  training  Tools  fee
3       DS    4.0  4.0

In [31]:
df.dropna(how='all') # It means if a row have all null values then drop it .

  training  Tools  fee
0       DS    NaN  NaN
1       ML    NaN  NaN
2       DL    2.0  NaN
3       DS    4.0  4.0

In [33]:
df.dropna(subset=['training']) # if training have any null then drop it.

  training  Tools  fee
0       DS    NaN  NaN
1       ML    NaN  NaN
2       DL    2.0  NaN
3       DS    4.0  4.0

In [34]:
df.dropna(subset=['fee']) # if fee have any null then drop it

  training  Tools  fee
3       DS    4.0  4.0

In [35]:
df.dropna(subset=['Tools']) # If tools have any null then drop it.

  training  Tools  fee
2       DL    2.0  NaN
3       DS    4.0  4.0

In [38]:
df['Tools'].dropna()

2    2.0
3    4.0
Name: Tools, dtype: float64

In [43]:
df.dropna(thresh=2) # thresh=2 means that df atleast have two non-null values.

  training  Tools  fee
2       DL    2.0  NaN
3       DS    4.0  4.0

In [44]:
df.dropna(thresh=3)

  training  Tools  fee
3       DS    4.0  4.0

In [45]:
df.dropna()

  training  Tools  fee
3       DS    4.0  4.0

In [47]:
df.fillna(3)

  training  Tools  fee
0       DS    3.0  3.0
1       ML    3.0  3.0
2       DL    2.0  3.0
3       DS    4.0  4.0

In [50]:
# Multiple values replacing
df.replace(['DS','ML',4],['DataSCience','Machinelearning',16])

          training  Tools   fee
0      DataSCience    NaN   NaN
1  Machinelearning    NaN   NaN
2               DL    2.0   NaN
3      DataSCience   16.0  16.0

In [52]:
print(df['Tools'].mean())
print(df['fee'].mean())

3.0
4.0

In [56]:
df['Tools'].replace(np.nan,df['Tools'].mean(), inplace=True)
df['fee'].replace(np.nan,df['fee'].mean(), inplace=True)

In [8]:
df = pd.read_clipboard()
df

          training  Tools   fee
0      DataSCience    NaN   NaN
1  Machinelearning    NaN   NaN
2               DL    2.0   NaN
3      DataSCience   16.0  16.0

In [67]:
df.iloc[:2,:] = df.iloc[:2,:].replace(regex=True, to_replace='[^0-9,A-Z]', value=np.nan)# 0-9 aur A-Z chor ky .

In [9]:
df

          training  Tools   fee
0      DataSCience    NaN   NaN
1  Machinelearning    NaN   NaN
2               DL    2.0   NaN
3      DataSCience   16.0  16.0

In [7]:
df1 = pd.read_clipboard()
df1

  training  Tools  fee
0       DS    NaN  NaN
1       ML    NaN  NaN
2       DL    2.0  NaN
3       DS    4.0  4.0

In [10]:
df.append(df1)

          training  Tools   fee
0      DataSCience    NaN   NaN
1  Machinelearning    NaN   NaN
2               DL    2.0   NaN
3      DataSCience   16.0  16.0
0               DS    NaN   NaN
1               ML    NaN   NaN
2               DL    2.0   NaN
3               DS    4.0   4.0

In [11]:
pd.concat([df,df1], axis=1)

          training  Tools   fee training  Tools  fee
0      DataSCience    NaN   NaN       DS    NaN  NaN
1  Machinelearning    NaN   NaN       ML    NaN  NaN
2               DL    2.0   NaN       DL    2.0  NaN
3      DataSCience   16.0  16.0       DS    4.0  4.0

In [12]:
pd.merge(df,df1, how='left', on='training' )

          training  Tools_x  fee_x  Tools_y  fee_y
0      DataSCience      NaN    NaN      NaN    NaN
1  Machinelearning      NaN    NaN      NaN    NaN
2               DL      2.0    NaN      2.0    NaN
3      DataSCience     16.0   16.0      NaN    NaN

In [13]:
pd.merge(df,df1,how='right', on='training')

  training  Tools_x  fee_x  Tools_y  fee_y
0       DL      2.0    NaN      2.0    NaN
1       DS      NaN    NaN      NaN    NaN
2       DS      NaN    NaN      4.0    4.0
3       ML      NaN    NaN      NaN    NaN

In [14]:
pd.merge(df,df1, on='training')

  training  Tools_x  fee_x  Tools_y  fee_y
0       DL      2.0    NaN      2.0    NaN

In [15]:
df1[~df1['fee'].isna()] # column specific
# lend = lend[~lend['Name of Lending Institution'].isna()]

  training  Tools  fee
3       DS    4.0  4.0

In [16]:
df1

  training  Tools  fee
0       DS    NaN  NaN
1       ML    NaN  NaN
2       DL    2.0  NaN
3       DS    4.0  4.0

In [17]:
dic = dict(name = ['Ali','awan','ahmad'], clas = [1,2,3], year = [111,np.nan,333])
dic2 = dict(name = ['kazmi','manaa','awan'], clas = [5,6,np.nan], year=[555,np.nan,666])

In [18]:
f1 = pd.DataFrame(dic)
f2 = pd.DataFrame(dic2)
f1

    name  clas   year
0    Ali     1  111.0
1   awan     2    NaN
2  ahmad     3  333.0

In [19]:
f2

    name  clas   year
0  kazmi   5.0  555.0
1  manaa   6.0    NaN
2   awan   NaN  666.0

In [20]:
pd.merge(f1,f2, how='left', on='name')

    name  clas_x  year_x  clas_y  year_y
0    Ali       1   111.0     NaN     NaN
1   awan       2     NaN     NaN   666.0
2  ahmad       3   333.0     NaN     NaN

In [21]:
pd.merge(f1,f2, how='right', on='name')

    name  clas_x  year_x  clas_y  year_y
0   awan     2.0     NaN     NaN   666.0
1  kazmi     NaN     NaN     5.0   555.0
2  manaa     NaN     NaN     6.0     NaN

In [22]:
pd.concat([f1,f2], axis=0)

    name  clas   year
0    Ali   1.0  111.0
1   awan   2.0    NaN
2  ahmad   3.0  333.0
0  kazmi   5.0  555.0
1  manaa   6.0    NaN
2   awan   NaN  666.0

In [23]:
pd.concat([f1,f2], axis=1)

    name  clas   year   name  clas   year
0    Ali     1  111.0  kazmi   5.0  555.0
1   awan     2    NaN  manaa   6.0    NaN
2  ahmad     3  333.0   awan   NaN  666.0

# Part-2

In [26]:
df = f1.join(f2, on='name', rsuffix=['year'] )

ValueError: You are trying to merge on object and int64 columns. If you wish to proceed you should use pd.concat

In [29]:
print(df.columns)
df[df.columns]

Index(['training', 'Tools', 'fee'], dtype='object')

          training  Tools   fee
0      DataSCience    NaN   NaN
1  Machinelearning    NaN   NaN
2               DL    2.0   NaN
3      DataSCience   16.0  16.0

In [30]:
df[df.columns[1:]]

   Tools   fee
0    NaN   NaN
1    NaN   NaN
2    2.0   NaN
3   16.0  16.0

In [31]:
import seaborn as sns

In [32]:
df = sns.load_dataset('iris')

In [35]:
df.head(3)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa

In [33]:
df.mean()

sepal_length    5.843333
sepal_width     3.057333
petal_length    3.758000
petal_width     1.199333
dtype: float64

In [34]:
df.mean(axis=1)

0      2.550
1      2.375
2      2.350
3      2.350
4      2.550
       ...
145    4.300
146    3.925
147    4.175
148    4.325
149    3.950
Length: 150, dtype: float64

In [36]:
df.mean(axis=0)

sepal_length    5.843333
sepal_width     3.057333
petal_length    3.758000
petal_width     1.199333
dtype: float64